In [42]:
import pandas as pd

In [43]:
df = pd.read_csv("../Data/data cleaning sample.csv")

In [44]:
df

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [45]:
df.sort_values("Age")

      Name   Age         City Gender              Email   Join Date
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [46]:
df.sort_values("Age", ascending = False)

      Name   Age         City Gender              Email   Join Date
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [47]:
df2 = df.sort_values(["Age", "Gender"]).copy()

In [48]:
df2.reset_index(drop = True) #If you want the index to start from 0 and be sequential, you can reset it using reset_index()

      Name   Age         City Gender              Email   Join Date
0    David  22.0       Mumbai      M  david@example.com  12-11-2019
1    Alice  25.0     New York      F  alice@example.com  01-05-2021
2    Alice  25.0     New York      F  alice@example.com  01-05-2021
3    Alice  25.0     New York      F  alice@example.com  01-05-2021
4      NaN  28.0        Delhi      F     eve@domain.com         NaN
5      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
6  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
7  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [49]:
df2

      Name   Age         City Gender              Email   Join Date
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [50]:
df2.reset_index(drop = True, inplace = True)

In [51]:
df2

      Name   Age         City Gender              Email   Join Date
0    David  22.0       Mumbai      M  david@example.com  12-11-2019
1    Alice  25.0     New York      F  alice@example.com  01-05-2021
2    Alice  25.0     New York      F  alice@example.com  01-05-2021
3    Alice  25.0     New York      F  alice@example.com  01-05-2021
4      NaN  28.0        Delhi      F     eve@domain.com         NaN
5      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
6  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
7  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [58]:
df2["Rank"] = df2["Age"].rank(ascending = False, method = "dense")

In [59]:
df2

      Name   Age         City Gender              Email   Join Date  Rank
0    David  22.0       Mumbai      M  david@example.com  12-11-2019   4.0
1    Alice  25.0     New York      F  alice@example.com  01-05-2021   3.0
2    Alice  25.0     New York      F  alice@example.com  01-05-2021   3.0
3    Alice  25.0     New York      F  alice@example.com  01-05-2021   3.0
4      NaN  28.0        Delhi      F     eve@domain.com         NaN   2.0
5      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020   1.0
6  Charlie   NaN        Delhi      M    charlie@example  20-07-2021   NaN
7  Charlie   NaN        Delhi      M    charlie@example  20-07-2021   NaN
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021   NaN

In [61]:
df2 = df2[["Name", "City", "Age", "Email", "Gender", "Join Date"]]

In [62]:
df2

      Name         City   Age              Email Gender   Join Date
0    David       Mumbai  22.0  david@example.com      M  12-11-2019
1    Alice     New York  25.0  alice@example.com      F  01-05-2021
2    Alice     New York  25.0  alice@example.com      F  01-05-2021
3    Alice     New York  25.0  alice@example.com      F  01-05-2021
4      NaN        Delhi  28.0     eve@domain.com      F         NaN
5      Bob  Los Angeles  30.0    bob@example.com      M  15-06-2020
6  Charlie        Delhi   NaN    charlie@example      M  20-07-2021
7  Charlie        Delhi   NaN    charlie@example      M  20-07-2021
8  Charlie        Delhi   NaN    charlie@example      M  20-07-2021